app/controllers/daily_assortments_controller.rb

  def index
    @daily_assortments = DailyAssortment.all
---
SELECT "daily_assortments".* FROM "daily_assortments"

  def create
    @daily_assortment = DailyAssortment.create!(daily_assortment_params)
---
INSERT INTO "daily_assortments" ("assortment_start_date", "article_id", "store_id", "in_cluster_only_because_of_promotion", "in_elimination", "provisioning_start_date", "replenishment_start_date", "is_replenishable", "article_name", "sub_family_id", "substitute_article_id", "sub_category_id", "is_article_without_price", "is_orderable_and_loadable", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def set_daily_assortment
    @daily_assortment = DailyAssortment.find(params[:id])
---
SELECT  "daily_assortments".* FROM "daily_assortments" WHERE "daily_assortments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]