app/controllers/sub_families_controller.rb

SELECT "sub_families".* FROM "sub_families"
---
  def index
    @sub_families = SubFamily.all

INSERT INTO "sub_families" ("sub_family_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sub_family_id", 1], ["name", "test"], ["created_at", "2018-08-17 12:28:29.796024"], ["updated_at", "2018-08-17 12:28:29.796024"]]
---
  def create
    @sub_family = SubFamily.create!(sub_family_params)