app/controllers/sub_categories_controller.rb

SELECT "sub_categories".* FROM "sub_categories"
---
  def index
    @sub_categories = SubCategory.all

INSERT INTO "sub_categories" ("sub_category_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["sub_category_id", 1], ["name", "test"], ["created_at", "2018-08-17 10:59:14.545733"], ["updated_at", "2018-08-17 10:59:14.545733"]]
---
  def create
    @sub_category = SubCategory.create!(sub_category_params)

DELETE FROM "sub_categories" WHERE "sub_categories"."id" = ?  [["id", 1]]
---
  def destroy
    @sub_category.destroy

SELECT  "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_sub_category
    @sub_category = SubCategory.find(params[:id])